"""  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
Поскольку разобраться в его кричалках не настолько просто, 
насколько легко он их придумывает, Вам стоит написать программу.
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, 
если во фразе несколько слов, то они разделяются дефисами. 
Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в
программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и 
“Пам парам”, если с ритмом все не в порядке
*Пример:*
**Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
    **Вывод:** Парам пам-пам   """

def rythm(poem):
    vowgels = (lambda phrase: sum(1 for i in phrase if i in 'ауоыиэяюёе'))
    new_list = []
    for phrase in poem:
       new_list.append(vowgels(phrase))
    if len(set(new_list)) == 1:
        return 'Парам пам-пам'
    else: return 'Пам парам'


poem_prases = list(input('Enter your poem: ').lower().split())
print(rythm(poem_prases))
